wty2019wty/esp32c3_sensors-THP-dash/ESP32/sdkconfig.defaults
# 目标芯片：ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# Flash：4MB Super Mini 常见配置
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# 关闭蓝牙，节省 Flash / 内存
CONFIG_BT_ENABLED=n

# Wi-Fi / 网络：设备只需 STA + HTTPS 上报
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# 主任务栈：Wi-Fi + TLS + HTTP 会话较占栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# TLS：启用系统证书捆绑包（Cloudflare / 公网 HTTPS）
# 注意：IDF 6.x 中 DEFAULT_BUNDLE / MAX_LEN 为隐藏符号，只开 CERTIFICATE_BUNDLE 即可
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
